In [5]:
import pandas as pd

In [6]:
df=pd.read_csv('../sample1.csv')

In [10]:
df.head(9)

   Sno             Name   Age   Salary        Designation      Mobile
0    1    Shabeeh Abbas  28.0   $82300     senior manager  9080706050
1    2  Kashish Jaiswal  21.0   $70000            manager  8798677809
2    3       Arsh singh   NaN   $64000     senior manager  8490765689
3    4     kriti rajput  25.0   $89000            manager  9987650044
4    5     nisha shukla  26.0   $58000  assistant manager  8976456001
5    6    pashant singh  22.0   $75000            manager  7767890022
6    7       aishwarya    NaN   $65000     senior manager  7645678900
7    8      anjani soni  23.0   $70980            manager  8900012333
8    9     aditya verma  24.0  $456700  assistant manager  9087666340

In [11]:
df.isnull()

     Sno   Name    Age  Salary  Designation  Mobile
0  False  False  False   False        False   False
1  False  False  False   False        False   False
2  False  False   True   False        False   False
3  False  False  False   False        False   False
4  False  False  False   False        False   False
5  False  False  False   False        False   False
6  False  False   True   False        False   False
7  False  False  False   False        False   False
8  False  False  False   False        False   False
9  False  False  False   False        False   False

In [12]:
df.isnull().sum()

Sno            0
Name           0
Age            2
Salary         0
Designation    0
Mobile         0
dtype: int64

In [8]:
def salary_clean(salary):
    if isinstance(salary,str):
        salary=salary.strip()
        if '$' in salary:
            salary=salary.replace('$','')
        if ',' in salary:
            salary=salary.replace(',','')
        return int(salary)
    return salary

In [9]:
df['Salary'].apply(salary_clean)

0     82300
1     70000
2     64000
3     89000
4     58000
5     75000
6     65000
7     70980
8    456700
9    560000
Name: Salary, dtype: int64

In [11]:
df['Salary']=df['Salary'].apply(salary_clean)
df

   Sno             Name   Age  Salary        Designation      Mobile
0    1    Shabeeh Abbas  28.0   82300     senior manager  9080706050
1    2  Kashish Jaiswal  21.0   70000            manager  8798677809
2    3       Arsh singh   NaN   64000     senior manager  8490765689
3    4     kriti rajput  25.0   89000            manager  9987650044
4    5     nisha shukla  26.0   58000  assistant manager  8976456001
5    6    pashant singh  22.0   75000            manager  7767890022
6    7       aishwarya    NaN   65000     senior manager  7645678900
7    8      anjani soni  23.0   70980            manager  8900012333
8    9     aditya verma  24.0  456700  assistant manager  9087666340
9   10     sneha shukla  21.0  560000            manager  8900044559

In [21]:
df.dropna()

   Sno             Name   Age  Salary        Designation      Mobile
0    1    Shabeeh Abbas  28.0   82300     senior manager  9080706050
1    2  Kashish Jaiswal  21.0   70000            manager  8798677809
3    4     kriti rajput  25.0   89000            manager  9987650044
4    5     nisha shukla  26.0   58000  assistant manager  8976456001
5    6    pashant singh  22.0   75000            manager  7767890022
7    8      anjani soni  23.0   70980            manager  8900012333
8    9     aditya verma  24.0  456700  assistant manager  9087666340
9   10     sneha shukla  21.0  560000            manager  8900044559

In [15]:
df.drop(['Mobile','Name','Sno'],axis=1,inplace=True) #this will make changes to original data

In [1]:
from sklearn.impute import SimpleImputer

In [2]:
imputer=SimpleImputer()

In [12]:
#trial run
cols=['Age','Salary']
imputer.fit_transform(df[cols])

array([[2.800e+01, 8.230e+04],
       [2.100e+01, 7.000e+04],
       [2.375e+01, 6.400e+04],
       [2.500e+01, 8.900e+04],
       [2.600e+01, 5.800e+04],
       [2.200e+01, 7.500e+04],
       [2.375e+01, 6.500e+04],
       [2.300e+01, 7.098e+04],
       [2.400e+01, 4.567e+05],
       [2.100e+01, 5.600e+05]])

In [13]:
#actual run
cols=['Age','Salary']
df[cols]=imputer.fit_transform(df[cols])

In [16]:
df

     Age    Salary        Designation
0  28.00   82300.0     senior manager
1  21.00   70000.0            manager
2  23.75   64000.0     senior manager
3  25.00   89000.0            manager
4  26.00   58000.0  assistant manager
5  22.00   75000.0            manager
6  23.75   65000.0     senior manager
7  23.00   70980.0            manager
8  24.00  456700.0  assistant manager
9  21.00  560000.0            manager

In [17]:
df['Designation'].value_counts()

manager              5
senior manager       3
assistant manager    2
Name: Designation, dtype: int64

In [18]:
#trial run
imp2=SimpleImputer(strategy='most_frequent')
imp2.fit_transform(df[['Designation']])

array([['senior manager'],
       ['manager'],
       ['senior manager'],
       ['manager'],
       ['assistant manager'],
       ['manager'],
       ['senior manager'],
       ['manager'],
       ['assistant manager'],
       ['manager']], dtype=object)

In [19]:
#actual run

df['Designation']=imp2.fit_transform(df[['Designation']])

In [20]:
gender=['male','female']*5

In [21]:
df['Gender']=gender# adding column

In [22]:
df

     Age    Salary        Designation  Gender
0  28.00   82300.0     senior manager    male
1  21.00   70000.0            manager  female
2  23.75   64000.0     senior manager    male
3  25.00   89000.0            manager  female
4  26.00   58000.0  assistant manager    male
5  22.00   75000.0            manager  female
6  23.75   65000.0     senior manager    male
7  23.00   70980.0            manager  female
8  24.00  456700.0  assistant manager    male
9  21.00  560000.0            manager  female

In [23]:
df.rename({'Salary':'Pay'},axis=1,inplace=True)

In [24]:
df

     Age       Pay        Designation  Gender
0  28.00   82300.0     senior manager    male
1  21.00   70000.0            manager  female
2  23.75   64000.0     senior manager    male
3  25.00   89000.0            manager  female
4  26.00   58000.0  assistant manager    male
5  22.00   75000.0            manager  female
6  23.75   65000.0     senior manager    male
7  23.00   70980.0            manager  female
8  24.00  456700.0  assistant manager    male
9  21.00  560000.0            manager  female

In [25]:
df.loc[0]

Age                      28.0
Pay                   82300.0
Designation    senior manager
Gender                   male
Name: 0, dtype: object

In [26]:
row=[{'Age':19,'Pay':19000,'Designation':'manager','Gender':'male'}]

In [29]:
df.loc[0]=df.append(row,ignore_index=1)

C:\Users\KASHISH JAISWAL\AppData\Local\Temp\ipykernel_2536\2106761099.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.loc[0]=df.append(row,ignore_index=1)

ValueError: Incompatible indexer with Series